package chapter01;

public class Comment01 {

	public static void main(String[] args) {
	//주석 설명
	// 행 주석	
	
	/*  단락주석
	 *  테스트 코드 제거용
	 *  or 프로그램 설명  
	 *     
	 *          
	 *     */
	 /*
	  * 1. JDK 출력문, 주석
	  * 
	  *  프로그래밍 = > 어떤 데이터를 입력하여 데이터를 처리하고 결과를 보여준다.
	  *								"문제 해결" 
	  *  하드웨어             키보드, 마우스		본체			모니터, 프린터
	  *  자바		   입력문			  소스코드			"출력문"
	  * 
	  * 
	  * 
	  * 							 입력된 데이터 : 자료
	  * 							 저장, 검색(조회), 변경(수정), 삭제
	  * 							C	  R		    U		  D
	  * 							=> 자료 구조
	  * 							변수, 배열, 컬렉션 프레임워크
	  * 
	  * 
	  * 
	  * 							문제를 정확하게, 빠르게 처리해서 해결
	  * 							=> 알고리즘
	  * 							연산자, 흐름제어, 함수(메서드)
	  * 
	  * 
	  * 
	  * 							=> "클래스"
	  * 							=> 만들어진 클래스를 적절하게 조립하여 하나의 프로그램을 만드는 방법론
	  * 								=> 객체지향 프로그램
	  */
	}

}
